In [33]:
'''
Numpy-Pandas_basic-2 specially focuses on numpy: (numpy boosts pandas. work with pandas)
1. DataFrame - Typechecking and Converting to Numpy
2. DataFrame - Renaming, Add or Drop a Column
3. DataFrame - Sorting
4. DataFrane - Creating a Copy, a View. and the loc function
5. DataFrame - Transpose of a DataFrame
'''
import numpy as np
import pandas as pd

In [34]:
df = pd.read_csv('imported.csv')

In [35]:
df

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [36]:
#1/5 Typechecking
type(df)

pandas.core.frame.DataFrame

In [37]:
df.dtypes

UK             object
Netherlands    object
Points          int64
dtype: object

In [38]:
# Converting to Numpy
df.to_numpy()

array([['bermuda', 'drenthe', 56],
       ['london', 'flevoland', 45],
       ['cayman islands', 'limburg', 1322],
       ['scotland', 'holland', 135]], dtype=object)

In [39]:
df

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [40]:
#2. Renaming a Column

In [41]:
df.columns

Index(['UK', 'Netherlands', 'Points'], dtype='object')

In [42]:
df.columns=list('ABC')

In [43]:
df

                A          B     C
0         bermuda    drenthe    56
1          london  flevoland    45
2  cayman islands    limburg  1322
3        scotland    holland   135

In [44]:
df.columns=['UK', 'Netherlands', 'Points']

In [45]:
df

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [46]:
#Add and Drop a Column - we will add later, using loc function
df.drop('UK',axis=1)

  Netherlands  Points
0     drenthe      56
1   flevoland      45
2     limburg    1322
3     holland     135

In [47]:
df

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [48]:
#3. Sort the Dataframe
df.sort_index(axis=0,ascending=0)

               UK Netherlands  Points
3        scotland     holland     135
2  cayman islands     limburg    1322
1          london   flevoland      45
0         bermuda     drenthe      56

In [49]:
#4. Create a Copy of Dataframe
df1 = df.copy()

In [50]:
df1

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [51]:
#create a view (pointer like)
view_df = df

In [52]:
view_df

               UK Netherlands  Points
0         bermuda     drenthe      56
1          london   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [53]:
view_df ['UK'][1] = 'example'

C:\Users\Asus\AppData\Local\Temp\ipykernel_10884\3272558207.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  view_df ['UK'][1] = 'example'
C:\Users\Asus\AppData\Local\Temp\ipykernel_10884\3272558207.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  view_df ['UK'][1] = 'example'

In [54]:
df #changing view_df will change original df also.

               UK Netherlands  Points
0         bermuda     drenthe      56
1         example   flevoland      45
2  cayman islands     limburg    1322
3        scotland     holland     135

In [55]:
# loc function is used for memory manipulation
df['UK'][0]

'bermuda'

In [56]:
df.loc[0,0]='hello'

In [57]:
df

               UK Netherlands  Points      0
0         bermuda     drenthe      56  hello
1         example   flevoland      45    NaN
2  cayman islands     limburg    1322    NaN
3        scotland     holland     135    NaN

In [58]:
df.loc[[0,1],['UK','Netherlands']]

        UK Netherlands
0  bermuda     drenthe
1  example   flevoland

In [59]:
df.loc[:,['UK','Netherlands']]

               UK Netherlands
0         bermuda     drenthe
1         example   flevoland
2  cayman islands     limburg
3        scotland     holland

In [60]:
df.loc[(df['Points']<100)]

        UK Netherlands  Points      0
0  bermuda     drenthe      56  hello
1  example   flevoland      45    NaN

In [61]:
df['Points']<100

0     True
1     True
2    False
3    False
Name: Points, dtype: bool

In [62]:
# iloc -> indexing
df.iloc[0,2]

np.int64(56)

In [63]:
#5. Transpose of a DataFrame
df.T

                   0          1               2         3
UK           bermuda    example  cayman islands  scotland
Netherlands  drenthe  flevoland         limburg   holland
Points            56         45            1322       135
0              hello        NaN             NaN       NaN

In [64]:
df

               UK Netherlands  Points      0
0         bermuda     drenthe      56  hello
1         example   flevoland      45    NaN
2  cayman islands     limburg    1322    NaN
3        scotland     holland     135    NaN